# ZGG的数组

ZGG语言提供了强大的数组功能。数组，可以定义为**有限个值的有序集合**

## 数组的声明与访问

数组声明方法：
```
[item0, item1, ...]
```
每个item是一个表达式，数组保存的是表达式计算后得到的值。下标从0开始

访问数组指定下标的元素的语法为：
```
arr[index]
```

## 数组的运算

### 加法

若干个数组相加，将返回一个新的数组，其内容为各个参与相加的数组的依次拼接
```
zgg> [1, 2, 3] + [4, 5, 6] + [7, 8, 9]
[1, 2, 3, 4, 5, 6, 7, 8, 9]
```
### 乘法

数组支持乘以一个大于等于0的整数，其作用为将其重复若干遍。如：
```
zgg> [1, 2, 3] * 3
[1, 2, 3, 1, 2, 3, 1, 2, 3]
zgg> [1, 2, 3] * 0
[]
```

### 数组推导式

ZGG支持通过类似Python的数组推导式生成新的数组。

以下是一些常见的数组推导式用法：
```
zgg> a := [1, 2, 3, 4, 5, 6]
[1, 2, 3, 4, 5, 6]
zgg> [item * item for item in a]
[1, 4, 9, 16, 25, 36]
zgg> [item * 2 for item in a if item % 2 == 0]
[4, 8, 12]
zgg> [v * 2 for v in 2..10] // 2..10在for..in里面相当于[2, 3, 4, 5, 6, 7, 8, 9, 10]，但不需要创建一个临时数组，效率更高
[4, 6, 8, 10, 12, 14, 16, 18, 20]
zgg> [v * 2 for v in 2..<10] // 2..<10在for..in里面相当于[2, 3, 4, 5, 6, 7, 8, 9]，但不需要创建一个临时数组，效率更高
[4, 6, 8, 10, 12, 14, 16, 18]
zgg> [v * 2 for v in 10]  // for .. in 10是for .. in 0..<10的简化写法
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
```

***注：乘以0的时候，即重复0遍，必然返回空数组***

## 数组的内置方法

为了提高工作效率，ZGG内置了大量实用的数组方法

| 方法名 | 作用 |
|-------|------|
| map | |
| filter | |
| reduce | |
| each | |
| push | 往数组末尾添加元素 |
| slice | 获取数组切片 |
| sort | 原地排序 |
| join | 将数组各元素依次拼接为一个字符串 |
| toMap | 将数组元素转为一个Map |
| toGroup | 将数组元素分组 |
| find  | 查找数组中出现的第一个符合预期的元素 |
| findIndex  | 查找数组中出现的第一个符合预期的元素的下标 |
| times  | // |

### map(mapper)
### filter(filterFunc)
### reduce(reducer, initialValue?)
### each(callback)
### find(predict)
### findIndex(predict)